saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32F1xx_DFP.2.3.0.pdsc
          <memory id="IROM1"                         start="0x08000000" size="0x000C0000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00014000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00253739.pdf" title="STM32F101xF STM32F101xG Data Sheet"/>
          <feature type="Timer"         n="12"      m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="SPI"           n="3"       m="18000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="3"       m="4500000"/>
          <feature type="UART"          n="2"       m="4500000"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32F101RG'  ***************************** -->
        <device Dname="STM32F101RG">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="36000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_XL"/>
          <debug svd="SVD/STM32F101xx.svd"/>

          <memory id="IROM1"                         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00014000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00253739.pdf" title="STM32F101xF STM32F101xG Data Sheet"/>
          <feature type="Timer"         n="12"      m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="SPI"           n="3"       m="18000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="3"       m="4500000"/>
          <feature type="UART"          n="2"       m="4500000"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32F101T4'  ***************************** -->
        <device Dname="STM32F101T4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="36000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_LD"/>
          <debug svd="SVD/STM32F101xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00210837.pdf" title="STM32F101x4 STM32F101x6 Data Sheet"/>
          <feature type="Timer"         n="2"       m="16"/>
          <feature type="ADC"           n="10"      m="16"/>
          <feature type="IOs"           n="26"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="2"       m="4500000"/>
          <feature type="QFP"           n="36"/>
        </device>

        <!-- *************************  Device 'STM32F101T6'  ***************************** -->
        <device Dname="STM32F101T6">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="36000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_LD"/>
          <debug svd="SVD/STM32F101xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00001800" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00210837.pdf" title="STM32F101x4 STM32F101x6 Data Sheet"/>
          <feature type="Timer"         n="2"       m="16"/>
          <feature type="ADC"           n="10"      m="16"/>
          <feature type="IOs"           n="26"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="2"       m="4500000"/>
          <feature type="QFP"           n="36"/>
        </device>

        <!-- *************************  Device 'STM32F101T8'  ***************************** -->
        <device Dname="STM32F101T8">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="36000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_MD"/>
          <debug svd="SVD/STM32F101xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002800" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00161561.pdf" title="STM32F101x8 STM32F101xB Data Sheet"/>
          <feature type="Timer"         n="3"       m="16"/>
          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="26"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="2"       m="4500000"/>
          <feature type="QFP"           n="36"/>
        </device>

        <!-- *************************  Device 'STM32F101TB'  ***************************** -->
        <device Dname="STM32F101TB">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="36000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_MD"/>
          <debug svd="SVD/STM32F101xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00161561.pdf" title="STM32F101x8 STM32F101xB Data Sheet"/>
          <feature type="Timer"         n="3"       m="16"/>
          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="26"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="2"       m="4500000"/>
          <feature type="QFP"           n="36"/>
        </device>

        <!-- *************************  Device 'STM32F101V8'  ***************************** -->
        <device Dname="STM32F101V8">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="36000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_MD"/>
          <debug svd="SVD/STM32F101xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002800" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00161561.pdf" title="STM32F101x8 STM32F101xB Data Sheet"/>
          <feature type="Timer"         n="3"       m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="80"/>
          <feature type="SPI"           n="2"       m="18000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="3"       m="4500000"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'STM32F101VB'  ***************************** -->
        <device Dname="STM32F101VB">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="36000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_MD"/>
          <debug svd="SVD/STM32F101xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00161561.pdf" title="STM32F101x8 STM32F101xB Data Sheet"/>
          <feature type="Timer"         n="3"       m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="80"/>
          <feature type="SPI"           n="2"       m="18000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="3"       m="4500000"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'STM32F101VC'  ***************************** -->
        <device Dname="STM32F101VC">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="36000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD"/>
          <debug svd="SVD/STM32F101xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00191174.pdf" title="STM32F101xC STM32F101xD STM32F101xE Data Sheet"/>
          <feature type="Timer"         n="6"       m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="80"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="SPI"           n="3"       m="18000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="3"       m="4500000"/>
          <feature type="UART"          n="2"       m="4500000"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'STM32F101VD'  ***************************** -->
        <device Dname="STM32F101VD">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="36000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD"/>
          <debug svd="SVD/STM32F101xx.svd"/>

