saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32F1xx_DFP.2.3.0.pdsc
    <component Cclass="CMSIS Driver" Cgroup="MCI"          Capiversion="2.2" Cversion="2.0" condition="STM32F1xx CMSIS GPIO DMA">
      <description>MCI Driver for STM32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_MCI0                /* Driver MCI0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/MCI_STM32F10x.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="Ethernet MAC" Capiversion="2.1" Cversion="2.2" condition="STM32F107 CMSIS GPIO">
      <description>Ethernet MAC Driver for STM32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_ETH_MAC0            /* Driver ETH_MAC0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/EMAC_STM32F10x.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Device"   Capiversion="2.1" Cversion="2.1" condition="STM32F102_3 CMSIS RTOS GPIO">
      <description>USB Device Driver for STM32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBD_STM32F10x.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Device"   Capiversion="2.1" Cversion="2.4" condition="STM32F105_7 CMSIS RTOS GPIO">
      <description>USB Device Driver for STM32F1 Connectivity Line Devices</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/OTG_STM32F10x_cl.c"/>
        <file category="source" name="RTE_Driver/USBD_STM32F10x_cl.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Host"     Capiversion="2.1" Cversion="2.4" condition="STM32F105_7 CMSIS RTOS GPIO">
      <description>USB Host Driver for STM32F1 Connectivity Line Devices</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/OTG_STM32F10x_cl.c"/>
        <file category="source" name="RTE_Driver/USBH_STM32F10x_cl.c"/>
      </files>
    </component>

    <!-- MCBSTM32E Development Board -->
    <bundle Cbundle="MCBSTM32E" Cclass="Board Support" Cversion="2.0.0">
      <description>Keil Development Board MCBSTM32E</description>
      <doc>Boards/Keil/MCBSTM32E/Documentation/mcbstm32e.chm</doc>
      <component Cgroup="A/D Converter" Capiversion="1.00" condition="STM32F1xx CMSIS">
        <description>A/D Converter Interface for Keil MCBSTM32E Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCBSTM32E/Common/ADC_MCBSTM32E.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="STM32F1xx CMSIS">
        <description>Graphic LCD Interface for Keil MCBSTM32E Development Board</description>
        <files>
          <file category="header" name="Boards/Keil/MCBSTM32E/Common/GLCD_Config.h"/>
          <file category="source" name="Boards/Keil/MCBSTM32E/Common/GLCD_Fonts.c"/>
          <file category="source" name="Boards/Keil/MCBSTM32E/Common/GLCD_MCBSTM32E.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1.0" Cvariant="16-bit IF" condition="STM32F1xx CMSIS">
        <description>emWin LCD 16-bit Interface for Keil MCBSTM32E Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCBSTM32E/Common/LCD_X.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" Capiversion="1.0.0" condition="STM32F1xx CMSIS GPIO">
        <description>Joystick Interface for Keil MCBSTM32E Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCBSTM32E/Common/Joystick_MCBSTM32E.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32F1xx CMSIS GPIO">
        <description>Buttons Interface for Keil MCBSTM32E Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCBSTM32E/Common/Buttons_MCBSTM32E.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32F1xx CMSIS GPIO">
        <description>LED Interface for Keil MCBSTM32E Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCBSTM32E/Common/LED_MCBSTM32E.c"/>
        </files>
      </component>
    </bundle>

    <!-- MCBSTM32C Development Board -->
    <bundle Cbundle="MCBSTM32C" Cclass="Board Support" Cversion="2.0.0">
      <description>Keil Development Board MCBSTM32C</description>
      <doc>Boards/Keil/MCBSTM32C/Documentation/mcbstm32c.chm</doc>
      <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="STM32F1xx CMSIS">
        <description>A/D Converter Interface for Keil MCBSTM32C Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCBSTM32C/Common/ADC_MCBSTM32C.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="STM32F1xx CMSIS GPIO SPI">
        <description>Graphic LCD Interface for Keil MCBSTM32C Development Board</description>
        <files>
          <file category="header" name="Boards/Keil/MCBSTM32C/Common/GLCD_Config.h"/>
          <file category="source" name="Boards/Keil/MCBSTM32C/Common/GLCD_Fonts.c"/>
          <file category="source" name="Boards/Keil/MCBSTM32C/Common/GLCD_MCBSTM32C.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1.0" Cvariant="SPI IF" condition="STM32F1xx CMSIS GPIO SPI">
        <description>emWin LCD SPI Interface for Keil MCBSTM32C Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCBSTM32C/Common/LCD_X.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" Capiversion="1.0.0" condition="STM32F1xx CMSIS GPIO">
        <description>Joystick Interface for Keil MCBSTM32C Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCBSTM32C/Common/Joystick_MCBSTM32C.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32F1xx CMSIS GPIO">
        <description>Buttons Interface for Keil MCBSTM32C Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCBSTM32C/Common/Buttons_MCBSTM32C.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32F1xx CMSIS GPIO">
        <description>LED Interface for Keil MCBSTM32C Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCBSTM32C/Common/LED_MCBSTM32C.c"/>
        </files>
      </component>
